
## Plan Result (stg)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.dets
* Update
  * azurerm_windows_virtual_machine.modernisation_windows[&#34;stgdartsmidmock&#34;]
  * module.postgresql_flexible[0].azurerm_postgresql_flexible_server.pgsql_server


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.dets will be created
  + resource "azurerm_storage_blob" "dets" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "darts-dets-blob-st-stg"
      + parallelism            = 8
      + size                   = 0
      + storage_account_name   = "sastgdartsartefacts"
      + storage_container_name = "dets-st-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_windows_virtual_machine.modernisation_windows["stgdartsmidmock"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "modernisation_windows" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Compute/virtualMachines/stgdartsmidmock"
        name                                                   = "stgdartsmidmock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (25 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.postgresql_flexible[0].azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-migration-stg"
        name                          = "darts-migration-stg"
      ~ sku_name                      = "GP_Standard_D16ds_v4" -> "GP_Standard_D16ds_v5"
        tags                          = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":298,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->